In [1]:
import pandas as pd
import random

# Criação do dataset simulado
data = {
    'Nome do Cliente': [],
    'Estabelecimento': [],
    'Hora da Compra': [],
    'Valor': []
}

# Definição do número de transações e clientes com fraude
num_transacoes = 100
clientes_fraude = ['João Silva', 'Maria Santos', 'Pedro Oliveira', 'Ana Costa']

# Geração das transações
for _ in range(num_transacoes):
    nome_cliente = random.choice(['João Silva', 'Maria Santos', 'Pedro Oliveira', 'Ana Costa',
                                 'Lucas Rodrigues', 'Mariana Almeida', 'Ricardo Souza',
                                 'Carla Mendes', 'Fernando Pereira', 'Juliana Santos',
                                 'Rafaela Lima', 'Diego Ferreira'])
    estabelecimento = random.choice(['Supermercado XYZ', 'Livraria ABC', 'Restaurante XYZ',
                                    'Loja de Eletrônicos ABC', 'Cafeteria XYZ', 'Supermercado ABC',
                                    'Restaurante ABC', 'Loja de Roupas XYZ', 'Farmácia ABC',
                                    'Posto de Gasolina XYZ', 'Padaria ABC', 'Academia XYZ'])
    hora_compra = f'{random.randint(0, 23):02d}:{random.randint(0, 59):02d}:{random.randint(0, 59):02d}'
    valor = random.uniform(1.0, 500.0)
    
    if nome_cliente in clientes_fraude:
        valor *= 5  # Multiplica o valor por 5 para simular uma transação fraudulenta
        
    data['Nome do Cliente'].append(nome_cliente)
    data['Estabelecimento'].append(estabelecimento)
    data['Hora da Compra'].append(hora_compra)
    data['Valor'].append(round(valor, 2))

# Criação do DataFrame
df = pd.DataFrame(data)

# Exibição do DataFrame
df

     Nome do Cliente        Estabelecimento Hora da Compra    Valor
0       Maria Santos       Supermercado ABC       09:59:47  1570.28
1     Pedro Oliveira           Livraria ABC       21:50:18  1940.73
2     Pedro Oliveira       Supermercado XYZ       18:39:07  1255.18
3       Rafaela Lima       Supermercado XYZ       23:45:17    81.99
4   Fernando Pereira            Padaria ABC       08:26:47    66.27
..               ...                    ...            ...      ...
95   Mariana Almeida        Restaurante XYZ       08:34:23   163.34
96    Pedro Oliveira       Supermercado ABC       17:59:07  1658.58
97         Ana Costa            Padaria ABC       15:47:39   905.69
98  Fernando Pereira  Posto de Gasolina XYZ       09:34:43   470.00
99    Juliana Santos       Supermercado ABC       02:23:28   435.33

[100 rows x 4 columns]

In [ ]:
teste =hora_compra.format("12:00:00")

In [31]:
teste1 = valor.__format__("120,00")

ValueError: Invalid format specifier

In [29]:
df

     Nome do Cliente          Estabelecimento Hora da Compra   Valor
0    Mariana Almeida             Livraria ABC       17:25:22  176.95
1   Fernando Pereira              Padaria ABC       13:07:21   73.72
2    Mariana Almeida         Supermercado ABC       02:22:33  132.53
3       Rafaela Lima              Padaria ABC       02:14:33  418.79
4    Mariana Almeida         Supermercado ABC       09:50:15  246.20
..               ...                      ...            ...     ...
95   Lucas Rodrigues          Restaurante ABC       16:20:14  182.53
96      Rafaela Lima       Loja de Roupas XYZ       20:52:16  386.28
97    Pedro Oliveira  Loja de Eletrônicos ABC       09:06:22  747.58
98    Juliana Santos              Padaria ABC       01:01:46  427.12
99   Lucas Rodrigues       Loja de Roupas XYZ       19:31:20  493.07

[100 rows x 4 columns]

In [9]:
x = 4

if x < 0: 
    print("1")
elif x == 0:
    print("2")
elif 0 < x <5:
    print("3")
else:
    print("bumbum")

3

In [10]:
tup =(4,5,6)

In [11]:
a_list = [1,2,3,None]

In [12]:
tup = ("foo","bar","baz")

In [13]:
b_list = list(tup)

In [14]:
b_list

['foo', 'bar', 'baz']

In [15]:
b_list[1]

'bar'

In [16]:
b_list[1] = "peekaboo"

In [17]:
b_list[1]

'peekaboo'

In [18]:
gen = range(10)

In [19]:
gen

range(0, 10)